## Interactive data (Pandas challenge)

In [5]:
# Importing pandas
import pandas as pd

# Creating a DataFrame with three columns and three rows
data = {'roll no': [10, 205, 3],
        'student': ['Alex', 'Bhamesh', 'Chandan'],
        'marks': [10.5, 20.3, 15.8]}

df = pd.DataFrame(data)

# Displaying the DataFrame
df

   roll no  student  marks
0       10     Alex   10.5
1      205  Bhamesh   20.3
2        3  Chandan   15.8

In [6]:
# View head 
df.head()

   roll no  student  marks
0       10     Alex   10.5
1      205  Bhamesh   20.3
2        3  Chandan   15.8

In [ ]:
# Index Data frame
df.index

In [29]:
# selecting and viewing first row 
df.loc[[0]]

   roll no student  marks
0       10    Alex   10.5

In [35]:
# selecting and viewing first column 

column = df['roll no']
column

0     10
1    205
2      3
Name: roll no, dtype: int64

In [40]:
# Writing the dataframe to new CSV
df.to_csv("C:\\Users\\Harsh\\Interactive_data\\Suram.csv")

##  Dynamic, interacive vizualization usefull when communicating data
<Answer>
Data communication is revolutionised by interactive data visualisations, which provide users with an engaging and dynamic experience. Interactive visuals, as opposed to static presentations, enable viewers to explore data hands-on by allowing them to navigate and analyse it. Users can tailor their views, concentrate on particular elements, and get insights at their own speed because to the flexibility. This flexibility offers consumers a variety of viewpoints, which is especially useful for multidimensional datasets. Interactive visualisations also function as instruments for storytelling, taking viewers through a story that clarifies complexity. These graphics break through conventional communication barriers with their cross-device compatibility and real-time updates, increasing the impact and accessibility of data in a web-driven, networked world.